---
kind: method
id: M:Autodesk.Revit.DB.SchedulableField.Equals(System.Object)
source: html/6c7eb245-51fc-bb42-6236-881bfc52626e.htm
---
# Autodesk.Revit.DB.SchedulableField.Equals Method

Determines whether the specified Object is equal to the current Object .

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`) - The other object to evaluate.